corgate/folder.orig/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 0 -10) 
    (10 0 -10) 
    (10 1 -10)  
    (-10 1 -10) 
    (-10 0 10)   
    (10 0 10)    
    (10 1 10)   
    (-10 1 10)  
);

meshQ
{
    cells   200; //mesh cells
}

blocks
(
    hex (0 1 2 3 4 5 6 7) ($meshQ.cells 1 $meshQ.cells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);



// ************************************************************************* //
