corgate/folder.orig/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
       
    }
    bottom
    {
        type            zeroGradient;
        
    }
    left
    {
        type            zeroGradient;
       
        
    }
    right
    {
        type            zeroGradient;
       
    }
    frontAndBack
    {
        type            empty;
      
    }
    corgate
    {
        type            zeroGradient;
       
    }
}

// ************************************************************************* //
